# =============================================================================
# Brewfile — Declarative Homebrew Package List
# Usage: brew bundle --file=Brewfile
# =============================================================================

# -----------------------------------------------------------------------------
# CLI Tools & Utilities
# -----------------------------------------------------------------------------

# Core utilities
brew "git"
brew "curl"
brew "wget"
brew "coreutils"        # GNU core utilities

# Modern CLI replacements
brew "bat"              # Better cat
brew "eza"              # Better ls
brew "ripgrep"          # Better grep
brew "fd"               # Better find
brew "fzf"              # Fuzzy finder
brew "jq"               # JSON processor
brew "yq"               # YAML processor

# Development tools
brew "gh"               # GitHub CLI
brew "lazygit"          # Git TUI
brew "git-delta"        # Syntax-highlighted diff pager
brew "tldr"             # Simplified man pages
brew "direnv"           # Per-directory env
brew "starship"         # Cross-shell prompt
brew "zoxide"           # Smarter cd (z replacement)
brew "btop"             # Resource monitor
brew "tree"             # Directory tree
brew "watch"            # Execute commands periodically
brew "mas"              # Mac App Store CLI

# Media
brew "ffmpeg"           # Video/audio processing

# Compression
brew "p7zip"
brew "unzip"

# Security
brew "cloudflared"      # DNS-over-HTTPS proxy

# -----------------------------------------------------------------------------
# Programming Languages & Toolchains
# -----------------------------------------------------------------------------

# Go
brew "go"

# Python
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipx"

# -----------------------------------------------------------------------------
# Container & Kubernetes
# -----------------------------------------------------------------------------

brew "colima"                    # Docker runtime for macOS
brew "docker"                    # Docker CLI
brew "docker-compose"            # Multi-container orchestration
brew "docker-credential-helper"  # Credential management
brew "kubernetes-cli"            # kubectl
brew "k9s"                       # Kubernetes TUI
brew "helm"                      # Kubernetes package manager
brew "kubectx"                   # Context/namespace switcher

# -----------------------------------------------------------------------------
# Applications (Casks)
# -----------------------------------------------------------------------------

# Terminal & Editors
cask "iterm2"
cask "visual-studio-code"
cask "cursor"

# AI & Productivity
cask "claude"
cask "obsidian"
cask "notion"
cask "notion-calendar"
cask "notion-mail"

# API & Development
cask "insomnia"
cask "tableplus"

# Browsers
cask "google-chrome"
cask "arc"
cask "firefox"

# Communication
cask "slack"
cask "discord"
cask "telegram"
cask "zoom"

# Utilities
cask "alfred"
cask "1password"
cask "rectangle"         # Window management
cask "caffeine"          # Prevent sleep
cask "hiddenbar"         # Menu bar management

# Security
cask "lulu"              # Outbound firewall
cask "nordvpn"

# Media
cask "spotify"

# Crypto
cask "trezor-suite"

# Fonts
cask "font-meslo-lg-nerd-font"
