anthropic.claude-code
astro-build.astro-vscode
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
pkief.material-icon-theme
rust-lang.rust-analyzer
tomoki1207.pdf
